// French (fr) AZERTY keyboard layout
module.exports = {
  keyboardLayouts: {
    default: [
      ['a', 'z', 'e', 'r', 't', 'y', 'u', 'i', 'o', 'p'],
      ['q', 's', 'd', 'f', 'g', 'h', 'j', 'k', 'l', 'm'],
      ['{shift}', 'w', 'x', 'c', 'v', 'b', 'n', '\u002C', '\u003B', '{bksp}'], // , ;
      ['123', '\u002E', '{space}', '\u0027', 'return'] // . '
    ],
    shift: [
      ['A', 'Z', 'E', 'R', 'T', 'Y', 'U', 'I', 'O', 'P'],
      ['Q', 'S', 'D', 'F', 'G', 'H', 'J', 'K', 'L', 'M'],
      ['{shift}', 'W', 'X', 'C', 'V', 'B', 'N', '\u003F', '\u002E', '{bksp}'], // ? .
      ['123', '\u002E', '{space}', '\u0027', 'return'] // . '
    ],
    numbers: [
      ['\u0026', '\u00E9', '\u0022', '\u0027', '\u0028', '\u002D', '\u00E8', '\u005F', '\u00E7', '\u00E0'], // & é " ' ( - è _ ç à
      ['1', '2', '3', '4', '5', '6', '7', '8', '9', '0'],
      ['{symbols}', '\u0040', '\u0023', '{bksp}'], // @ #
      ['ABC', '\u002C', '{space}', '\u002E', 'return'] // , .
    ],
    symbols: [
      ['\u007E', '\u0023', '\u007B', '\u005B', '\u007C', '\u0060', '\u005C', '\u005E', '\u0040', '\u005D'], // ~ # { [ | ` \ ^ @ ]
      ['\u20AC', '\u0024', '\u00A3', '\u00A5', '\u0025', '\u003C', '\u003E', '\u002A', '\u002B', '\u003D'], // € $ £ ¥ % < > * + =
      ['{numbers}', '{bksp}'],
      ['ABC', '\u002C', '{space}', '\u002E', 'return'] // , .
    ]
  },
  umlautMappings: {
    'a': ['\u00E0', '\u00E2', '\u00E4'], // à â ä
    'A': ['\u00C0', '\u00C2', '\u00C4'], // À Â Ä
    'e': ['\u00E9', '\u00E8', '\u00EA', '\u00EB'], // é è ê ë
    'E': ['\u00C9', '\u00C8', '\u00CA', '\u00CB'], // É È Ê Ë
    'i': ['\u00EE', '\u00EF'], // î ï
    'I': ['\u00CE', '\u00CF'], // Î Ï
    'o': ['\u00F4', '\u00F6'], // ô ö
    'O': ['\u00D4', '\u00D6'], // Ô Ö
    'u': ['\u00F9', '\u00FB', '\u00FC'], // ù û ü
    'U': ['\u00D9', '\u00DB', '\u00DC'], // Ù Û Ü
    'c': ['\u00E7'], // ç
    'C': ['\u00C7']  // Ç
  }
};